Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Note that the `quarkus-test-oidc-server` extension includes a signing RSA private key file in a `JSON Web Key` (`JWK`) format and points to it with a `smallrye.jwt.sign.key.location` configuration property. It allows to use a no argument `sign()` operation to sign the token.
zh_cn: 请注意， `quarkus-test-oidc-server` 扩展包括一个 `JSON Web Key` ( `JWK` ) 格式的签名 RSA 私钥文件，并通过 `smallrye.jwt.sign.key.location` 配置属性指向它。它允许使用一个无参数的 `sign()` 操作来签署令牌。

source: Note that the method returns the specific type of `MeterRegistry` as a `@Singleton`. Use MicroProfile Config to inject any configuration attributes you need to configure the registry. Most Micrometer registry extensions, like `quarkus-micrometer-registry-statsd`, define a producer for registry-specific configuration objects that are integrated with the Quarkus configuration model.
zh_cn: 请注意，该方法返回了一个特定类型的 `MeterRegistry` 的 `@Singleton` 。使用MicroProfile Config来注入任何您需要更改registry的配置属性。大多数Micrometer registry扩展，如 `quarkus-micrometer-registry-statsd` ，为registry特定的配置对象定义了一个用于与Quarkus配置模型集成的生产者。

source: Note that the rebalance listener methods are called from the Kafka polling thread and **will** block the caller thread until completion. That’s because the rebalance protocol has synchronization barriers, and using asynchronous code in a rebalance listener may be executed after the synchronization barrier.
zh_cn: 请注意，再平衡(rebalance)监听器方法是在Kafka轮询线程中被调用的，并且 *会* 阻塞调用者线程直到完成。这是因为再平衡协议(rebalance protocol)有同步屏障，而在再平衡监听器中的异步代码可能会在同步屏障之后执行。

source: Note that the successful processing of the incoming record batch will commit the latest offsets for each partition received inside the batch. The configured commit strategy will be applied for these records only.
zh_cn: 注意，对于接收到的记录批次的成功处理会提交所收到批次内每个分区的最新偏移量。所配置的提交策略将只应用于这些记录。

source: Note that there is no dependency on Mockito, you can use any mocking library you like, or even manually override the objects to provide the behaviour you require.
zh_cn: 请注意，这里并不依赖Mockito，您可以使用任何您喜欢的mocking库，甚至可以手动覆盖对象以提供您需要的行为。

source: Note that these features use the mapper managed by the `quarkus-jackson` extension. Refer to xref:rest-json.adoc#json[Jackson configuration] to customize the mapping.
zh_cn: 注意，这些功能使用由 `quarkus-jackson` 扩展管理的映射器。请参考 link:rest-json.html#json[Jackson的配置] 来自定义映射。

source: Note that this configuration is a build time configuration, the property expression will be resolved at build time.
zh_cn: 注意，这个配置是构建时的配置，属性表达将在构建时被解析。

source: Note that to achieve this, an _admin connection_ is required. You can adjust the timeout for topic verification calls to the broker using the `health-topic-verification-timeout` configuration.
zh_cn: 注意，要实现这一点， 一个_管理员连接_是必须存在的 。您可以使用 `health-topic-verification-timeout` 来调整对broker的topic验证调用的超时时间。

source: Note that we did not define any annotation such as `@RolesAllowed` to explicitly enforce access to a resource. The extension will be responsible to map the URIs of the protected resources you have in Keycloak and evaluate the permissions accordingly, granting or denying access depending on the permissions that will be granted by Keycloak.
zh_cn: 请注意，我们没有定义任何注解，如 `@RolesAllowed` ，以明确地执行对资源的访问。扩展将负责映射在Keycloak中的受保护资源的URI，并相应地评估权限，然后根据由Keycloak授予的权限来授予或拒绝访问。

source: Note that we differentiate two contexts where the solution applied might be different:
zh_cn: 请注意，我们区分了两种情况，适用的解决方案可能是不同的：

source: Note that while having retries in a reliable system is a best practice, the `max.in.flight.requests.per.connection` parameter defaults to `5`, meaning that the order of the messages is not guaranteed. If the message order is a must for your use case, setting `max.in.flight.requests.per.connection` to `1` will make sure a single batch of messages is sent at a time, in the expense of limiting the throughput of the producer.
zh_cn: 请注意，虽然在对一个可靠的系统来说拥有重试机制是一种最佳实践，但 `max.in.flight.requests.per.connection` 参数默认为 `5` 将会意味着消息的顺序不会被保证。如果消息的顺序对您来说是必须保证的，将 `max.in.flight.requests.per.connection` 设置为 `1` 将确保一次只发送一批消息，但代价是限制生产者的吞吐量。

source: Note that you can reference nested properties using the `.` (dot) separator as in `{x.factor}`.
zh_cn: 注意，你可以使用 `.` (点)分隔符来引用嵌套的属性，如 `{x.factor}` 。

source: Note that you can't access the injected `JsonWebToken` in the public methods if the token verification has not been done.
zh_cn: 请注意，如果没有进行令牌验证，你就不能在公共方法中使用注入的 `JsonWebToken` 。

source: Note that you need to be extremely careful here as anything in `META-INF/resources` will be exposed as static web resources. So this directory is not a shortcut for "let's automatically include these resources in the native executable" and should only be used for static web resources.
zh_cn: 请注意，你在这里需要非常小心，因为 `META-INF/resources` 中的任何东西都会作为静态网络资源暴露出来。所以这个目录不是 "让我们自动把这些资源包含在本地可执行文件中 "的捷径，而应该只用于静态网络资源。

source: Note that, depending on how many resources you have in Keycloak the time taken to fetch them may impact your application startup time.
zh_cn: 请注意，基于您在Keycloak中的资源数量，获取这些资源的时间可能会影响您的应用程序的启动时间。

source: Note the addition of `-kotlin` on the end. Generally you'll only need this version but if your project will be using both Java and Kotlin code, you can safely include both artifacts.
zh_cn: 注意最后添加了 `-kotlin` 。通常你只需要这个版本，但如果你的项目将同时使用 Java 和 Kotlin 代码，你可以安全地包含这两个工件。

source: Note the usage of an `Emitter<Record<K, V>>`
zh_cn: 声明 `Emitter<Record<K, V>>` 的使用

source: Note we don't need to specify a path here, as `/hello` is the default for this test
zh_cn: 注意我们不需要在此指定路径，因为 `/hello` 是这个测试的默认路径

source: Note you can also use the injected `JsonWebToken` to access the individual claims in which case setting `@RequestScoped` is not necessary.
zh_cn: 请注意，你也可以使用注入的 `JsonWebToken` 来访问各个声明(claims)，在这种情况下，设置 `@RequestScoped` 是没有必要的。

source: Note: If you want to use the `AuthzClient` directly make sure to set `quarkus.keycloak.policy-enforcer.enable=true` otherwise there is no Bean available for injection.
zh_cn: 注意：如果您想直接使用 `AuthzClient` ，请确保设置 `quarkus.keycloak.policy-enforcer.enable=true` ，否则将没有Bean可供注入。

source: Nothing fancy. One important thing to note is that having a default constructor is required by the JSON serialization layer.
zh_cn: 这非常的简单。需要注意的一件事是， JSON 序列化层需要具有默认构造函数。

source: Nothing needed in IntelliJ IDEA because the IDE will pick the `systemPropertyVariables` from the surefire plugin configuration in `pom.xml`.
zh_cn: 在IntelliJ中不需要任何改动，因为IDE会从 `pom.xml` 中的surefire插件配置中选择 `systemPropertyVariables` 。

source: Nothing spectacular here. On each received quote, it updates the page.
zh_cn: 这里没有什么特别之处。对于每一个收到的报价，它都会更新页面。

source: Notice that there is no tracing specific code included in the application. By default, requests sent to this endpoint will be traced without any required code changes.
zh_cn: 请注意，应用程序中没有包含任何关于追踪的代码。默认情况下，不需要修改任何必要的代码就可以实现对发送到这个节点的请求进行追踪。

source: Notice there's an extra bit in the key (the `second` segment). The syntax is as follows: `quarkus.redis.[optional name.][redis configuration property]`. If the name is omitted, it configures the default client.
zh_cn: 请注意，在第二个配置项中有额外的一段（ `second` 段）。具体语法： `quarkus.redis.[可选的配置名称][Redis配置属性名]` 。如果省略名称，则为默认客户端的配置。

source: Notice there's an extra bit in the key (the `users` and `inventory` segments). The syntax is as follows: `quarkus.mongodb.[optional name.][mongo connection property]`. If the name is omitted, it configures the default client.
zh_cn: 注意在键中有一个额外的位（ `users` 和 `inventory` 段）。语法如下： `quarkus.mongodb.[optional name.][mongo connection property]` 。如果省略了名称，则配置默认的客户端。

source: Notice there's an extra bit in the key. The syntax is as follows: `quarkus.flyway.[optional name.][datasource property]`.
zh_cn: 请注意，键中有一个额外的位。语法如下： `quarkus.flyway.[optional name.][datasource property]` .

source: Now Available
zh_cn: 现已可用

source: Now browse to http://localhost:4000
zh_cn: 现在用浏览器访问 http://localhost:4000

source: Now create a `org.acme.mongodb.FruitService` that will be the business layer of our application and store/load the fruits from the mongoDB database.
zh_cn: 现在创建一个 `org.acme.mongodb.FruitService` ，它将是我们应用程序的业务层，并从mongoDB数据库 store/load fruits。

source: Now generate the token again and run:
zh_cn: 现在再次生成令牌并运行：

source: Now let's add a simple web page to display our list of legumes. In the `src/main/resources/META-INF/resources` directory, add a `legumes.html` file with the content from this {quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/legumes.html[legumes.html] file in it.
zh_cn: 现在让我们添加一个简单的网页来显示我们的legumes列表。在 `src/main/resources/META-INF/resources` 目录中，添加一个 `legumes.html` 文件，其中包含这个{quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/legumes.html[legumes.html] 文件的内容。

source: Now let's add a simple web page to interact with our `FruitResource`. Quarkus automatically serves static resources located under the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, add a `fruits.html` file with the content from this {quickstarts-blob-url}/mongodb-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] file in it.
zh_cn: 现在让我们添加一个简单的网页来与我们的 `FruitResource` 进行交互。Quarkus会自动提供位于 `META-INF/resources` 目录下的静态资源。在 `src/main/resources/META-INF/resources` 目录中，添加一个 `fruits.html` 文件，其中包含这个 {quickstarts-blob-url}/mongodb-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] 文件的内容。

source: Now let's add a simple web page to interact with our `FruitResource`. Quarkus automatically serves static resources located under the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, add a `fruits.html` file with the content from this {quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] file in it.
zh_cn: 现在让我们添加一个简单的网页来与我们的 `FruitResource` 进行交互。Quarkus自动提供位于 `META-INF/resources` 目录下的静态资源。在 `src/main/resources/META-INF/resources` 目录中，添加一个 `fruits.html` 文件，其中包含这个{quickstarts-blob-url}/rest-json-quickstart/src/main/resources/META-INF/resources/fruits.html[fruits.html] 文件的内容。

source: Now let's add a suffix for a greeting for which we'll set a default value.
zh_cn: 现在，让我们为greeting 添加一个后缀，我们将为其设置一个默认值。

source: Now let's assume that we have the following tests:
zh_cn: 现在让我们假设有以下测试：

source: Now let's consume the quote request and give out a price. Inside the `processor` project, locate the `src/main/java/org/acme/amqp/processor/QuoteProcessor.java` file and add the following:
zh_cn: 现在让我们来消费报价请求，并给出一个价格。在 `processor` 项目中，找到 `src/main/java/org/acme/amqp/processor/QuoteProcessor.java` 文件，并添加以下内容：

source: Now let's create a `LegumeResource` REST service with only one method which returns the list of legumes.
zh_cn: 现在让我们创建一个 `LegumeResource` REST服务，它只有一个返回legumes类列表的方法。

source: Now let's use this to make a secured request to the /secured/roles-allowed endpoint. Make sure you have the Quarkus server still running in dev mode, and then run the following command, making sure to use your version of the generated JWT from the previous step:
zh_cn: 现在让我们用它来向/secured/roles-allowed端点发出一个安全请求。确保你的Quarkus服务器仍然运行在开发模式下，然后运行以下命令，确保使用你在上一步中生成的JWT：

source: Now modify `GreetingResource` to start using the `GreetingProperties`:
zh_cn: 现在，修改 `GreetingResource` 以使用 `GreetingProperties` :

source: Now that the REST endpoint is running, we can access it using a command line tool like curl:
zh_cn: 现在，REST端点正在运行，我们可以使用curl这样的命令行工具来访问它：

source: Now that we can generate a JWT to access our secured REST endpoints, let's see what more we can do with the `JsonWebToken` interface and the JWT claims. The `org.eclipse.microprofile.jwt.JsonWebToken` interface extends the `java.security.Principal` interface, and is in fact the type of the object that is returned by the `javax.ws.rs.core.SecurityContext#getUserPrincipal()` call we used previously. This means that code that does not use CDI but does have access to the REST container `SecurityContext` can get hold of the caller `JsonWebToken` interface by casting the `SecurityContext#getUserPrincipal()`.
zh_cn: 现在我们可以生成一个JWT来访问我们的安全REST端点，让我们看看我们还能用 `JsonWebToken` 接口和JWT请求做什么。 `org.eclipse.microprofile.jwt.JsonWebToken` 接口扩展了 `java.security.Principal` 接口，事实上，它是我们之前使用的 `javax.ws.rs.core.SecurityContext#getUserPrincipal()` 调用返回的对象的类型。这意味着不使用CDI但可以访问REST容器 `SecurityContext` 的代码，可以通过转换 `SecurityContext#getUserPrincipal()` 来得到调用者 `JsonWebToken` 的接口。

source: Now using your favorite editor or IDE, update `ReactiveGreetingResource.kt` and change the `hello` method to the following:
zh_cn: 现在使用您喜欢的编辑器或IDE，更新 `ReactiveGreetingResource.kt` ，并将 `hello` 方法改为如下：

source: Now we are ready to run our application. If using `application.properties` to configure the tracer:
zh_cn: 现在我们准备运行我们的应用程序。如果使用 `application.properties` 来配置tracer：

source: Now we are ready to run our application. Use:
zh_cn: 现在我们准备运行我们的应用程序。使用：

source: Now we are ready to run our application:
zh_cn: 现在我们已经准备好运行我们的应用程序：

source: Now we can generate a JWT to use with `TokenSecuredResource` endpoint. To do this, run the following command:
zh_cn: 现在我们可以生成一个JWT，然后与 `TokenSecuredResource` 端点一起使用。要做到这一点，运行以下命令：

source: Now we have defined our profile we need to include it on our test class. We do this by annotating the test class with `@TestProfile(MockGreetingProfile.class)`.
zh_cn: 现在我们已经定义了我们自己的profile，我们需要在我们的测试类中引入它。我们通过在测试类中注解 `@TestProfile(MockGreetingProfile.class)` 来做到这一点。

source: Now we have three properties in our `GreetingProperties` class. While `name` could be considered more of a runtime property (and maybe could be passed as an HTTP query parameter in the future), `text` and `suffix` are used to define a message template. Let's group these two properties in a separate inner class:
zh_cn: 现在，在我们的 `GreetingProperties` 类中有三个属性。虽然 `name` 可以更多地被认为是运行时属性（也许在将来可以被作为HTTP查询参数进行传递），而 `text` 和 `suffix` 被用于定义一个消息模板。让我们将这两个属性作为一组放在一个独立的内部类中:

source: Now when you run the native build all these files will be included within `function.zip`
zh_cn: 现在，当你运行原生构建时，所有这些文件都将包含在 `function.zip` 中

source: Now you can start your application and Quarkus will run the Flyway's migrate method according to your config.
zh_cn: 现在可以启动你的应用程序，Quarkus会根据你的配置来运行Flyway的迁移方法。

source: Now you can use the AWS console to view and test your new lambda function.
zh_cn: 现在你可以使用AWS控制台来查看和测试你的新lambda函数。

source: Now, create the `org.acme.mongodb.FruitResource` class as follows:
zh_cn: 现在，创建 `org.acme.mongodb.FruitResource` 类，如下所示：

source: Now, create the `org.acme.rest.json.FruitResource` class as follows:
zh_cn: 现在，创建 `org.acme.rest.json.FruitResource` 类，如下所示。

source: Now, in your code, you can create an instance of `WebClient`:
zh_cn: 现在，在你的代码中，你可以创建一个 `WebClient` 的实例：

source: Now, running the command `curl http://localhost:8080/increments/first` should return the following result:
zh_cn: 现在，运行命令 `curl http://localhost:8080/increments/first` 应返回以下结果：

source: Now, running the command `curl http://localhost:8080/increments` should return an empty list `[]`
zh_cn: 现在，运行命令 `curl http://localhost:8080/increments` 应该返回一个空列表 `[]`

source: Now, we need the other side: the component receiving the name and replying. Create the `src/main/java/org/acme/GreetingService.java` file with the following content:
zh_cn: 现在，我们需要另一侧: 接收姓名并回复的组件。 使用以下内容创建 `src/main/java/org/acme/GreetingService.java` 文件:

source: Now, your Kafka messages will contain a JSON-B serialized representation of your `Fruit` data object.
zh_cn: 现在，您的Kafka消息将包含 `Fruit` 数据对象的JSON-B序列化格式。

source: Now, your Kafka messages will contain a Jackson serialized representation of your `Fruit` data object. In this case, the `deserializer` configuration is not necessary as the <<serialization-autodetection>> is enabled by default.
zh_cn: 现在，您的Kafka消息将包含 `Fruit` 数据对象的Jackson序列化格式。在这种情况下，`deserializer` 的配置不是必须的，因为 link:#serialization-autodetection[[序列化自动侦测]] 是默认启用的。

source: OAuth authentication works for both JVM and native modes. Since SSL in not enabled by default in native mode, `quarkus.ssl.native=true` must be added to support JaasClientOauthLoginCallbackHandler, which uses SSL. (See the xref:native-and-ssl.adoc[Using SSL with Native Executables] guide for more details.)
zh_cn: OAuth认证在JVM和原生模式下都有效。由于SSL在原生模式下默认不启用，所以必须添加 `quarkus.ssl.native=true` ，以支持JaasClientOauthLoginCallbackHandler。它使用了SSL。(更多细节请参见《 link:native-and-ssl.html[在原生可执行文件中使用SSL] 》指南)。

source: OAuth2 authentication
zh_cn: OAuth2 认证机制

source: OIDC `service` application needs to know OpenID Connect provider's token, `JsonWebKey` (JWK) set and possibly `UserInfo` and introspection endpoint addresses.
zh_cn: OIDC `service` 应用程序需要知道OpenID Connect提供者的令牌、 `JsonWebKey` (JWK)集以及可能的 `UserInfo` 和自省端点地址。

source: Observability
zh_cn: 可观察性

source: Often one obtains a JWT from an identity manager like https://www.keycloak.org/[Keycloak], but for this quickstart we will generate our own using the JWT generation API provided by `smallrye-jwt` (see xref:security-jwt-build.adoc[Generate JWT tokens with SmallRye JWT] for more information).
zh_cn: 通常情况下，人们会从身份管理服务器（如 link:https://www.keycloak.org/[Keycloak] ）那里获得JWT，但在这个快速入门中，我们将使用 `smallrye-jwt` 提供的JWT生成API来生成我们自己的JWT（更多信息 link:smallrye-jwt-build.html[见用SmallRye JWT生成JWT令牌] ）。

source: Oh yeah! We had quite a few extensions written outside the Quarkus "initial" team.
zh_cn: 噢，是的！我们在Quarkus "初始" 团队之外编写了相当多的扩展。

source: On Linux you can enable the following socket options:
zh_cn: 在Linux上，你可以启用以下socket选项：

source: On Linux, you will need GCC, and the glibc and zlib headers. Examples for common distributions:
zh_cn: 在Linux上，你将需要GCC，以及glibc和zlib头文件。常见发行版的例子：

source: On MacOS Sierra and above you can enable the following socket options:
zh_cn: 在MacOS Sierra及以上版本，你可以启用以下socket选项：

source: On Windows, you will have to go through the Control Panel to set your environment variables.
zh_cn: 在Windows上，您将需要通过控制面板来设置环境变量。

source: On Windows, you will need to install the https://aka.ms/vs/15/release/vs_buildtools.exe[Visual Studio 2017 Visual C++ Build Tools]
zh_cn: 在Windows上，你将需要安装 https://aka.ms/vs/15/release/vs_buildtools.exe[Visual Studio 2017 Visual C++构建工具]

source: On _outgoing_ channels, you can enable Snappy compression by setting the `compression.type` attribute to `snappy`:
zh_cn: 在 _出站_ channels 上，您可以通过将 `compression.type` 设置为 `snappy` 来启用Snappy压缩：

source: On a post request, generate a random UUID and send it to the AMQP queue using the emitter.
zh_cn: 在post请求中，生成一个随机的UUID，并使用emitter将其发送给AMQP队列。

source: On macOS (not supported by Mandrel), point the variable to the `Home` sub-directory:
zh_cn: 在macOS上（Mandrel不支持），将该变量指向 `Home` 子目录：

source: On the other side, the reactive model relies on non-blocking I/Os and a different execution model. Non-blocking I/O provides an efficient way to deal with concurrent I/O. A minimal amount of threads called I/O threads, can handle many concurrent I/O. With such a model, request processing is not delegated to a worker thread but uses these I/O threads directly.It saves memory and CPU as there is no need to create worker threads to handle the requests. It also improves the concurrency as it removes the constraint on the number of threads. Finally, it also improves response time as it reduces the number of thread switches.
zh_cn: 另一方面，响应式模型依赖于非阻塞 I/O和不同的执行模型。非阻塞I/O提供了一种处理并发I/O的有效方法。最小数量的线程称为I/O线程，可以处理许多并发I/O。使用这样的模型，请求处理不会委托给工作线程，而是直接使用这些I/O线程。它节省了内存和CPU，因为不需要创建工作线程来处理请求。它还改善了并发性，因为它消除了对线程数量的限制。最后，它还改善了响应时间，因为它减少了线程开关的数量。

source: Once added to your project, you can map _channels_ to AMQP addresses by configuring the `connector` attribute:
zh_cn: 一旦添加到你的项目中，你就可以通过配置 `connector` 属性将 _channels_ 映射到AMQP地址:

source: Once generated, look at the `pom.xml`. You will find the import of the Quarkus BOM, allowing you to omit the version of the different Quarkus dependencies. In addition, you can see the `quarkus-maven-plugin` responsible of the packaging of the application and also providing the development mode.
zh_cn: 一旦生成，请看 `pom.xml` 。你会发现Quarkus BOM的导入，允许你省略不同Quarkus依赖的版本。此外，你可以看到 `quarkus-maven-plugin` ，负责应用程序的打包，也提供开发模式。

source: Once packaged, run `docker compose up --build`. The UI is exposed on http://localhost:8080/quotes.html
zh_cn: 一旦打包完成，请运行 `docker compose up --build` 。UI在 http://localhost:8080/quotes.html

source: Once selected, click on "Generate your application", download the zip file, unzip it and open the code in your favorite IDE.
zh_cn: 选中后，单击 "Generate your application"，下载压缩文件，解压缩并在您喜欢的IDE中打开代码。

source: Once started, you can request the provided endpoint:
zh_cn: 一旦启动，你可以发送请求到提供服务的端点。

source: Once the bearer JWT token's signature has been verified and its `expires at` (`exp`) claim has been checked, the `iss` (`issuer`) claim value is verified next.
zh_cn: 一旦无记名JWT令牌的签名被验证，其 `expires at` ( `exp` )声明会被检查，接下来也会验证 `iss` ( `issuer` )声明的值。

source: Once the build is finished, you can run the executable with:
zh_cn: 构建完成后，可以用以下命令运行可执行文件：

source: Once the file is read, the content is stored in an in-memory buffer. We transform this buffer into a String.
zh_cn: 一旦文件被读取，其内容就被存储在一个内存缓冲区内。我们将这个缓冲区的内容转换为一个字符串。

source: Once the persist operation completes, we send the entity to Kafka. The `send` method returns a `Uni<Void>`.
zh_cn: 一旦持久化操作完成，我们就把实体发送到Kafka。 `send` 方法会返回一个 `Uni<Void>` 。

source: Once the reply is received by the sender, the content is written to the HTTP response
zh_cn: 一旦发送方收到回复，会将内容写入 HTTP 响应

source: Once we have the Redis server running, we need to configure the Redis connection properties. This is done in the `application.properties` configuration file. Edit it to the following content:
zh_cn: 运行Redis服务后，我们需要在 `application.properties` 配置文件中配置Redis连接属性，增加以下内容：

source: Once you have written your entity, here are the most common operations you will be able to perform:
zh_cn: 编写实体后，可以执行以下最常见的操作：

source: Once you have written your repository, here are the most common operations you will be able to perform:
zh_cn: 编写存储库后，您可以执行以下最常见的操作：

source: One of the core features of Vert.x is the https://vertx.io/docs/vertx-core/java/#event_bus[event bus]. It provides a message-based backbone to your application. So, you can have components interacting using asynchronous message passing, and so decouple your components. You can send a message to a single consumer, or dispatch to multiple consumers, or implement a request-reply interaction, where you send a message (request) and expect a response. This is what we are going to use in this section. Our `VertxResource` will send a message containing a name to the `greetings` address. Another component will receive the message and produce the "hello $name" response. The `VertxResource` will receive the response and return it as the HTTP response.
zh_cn: Vert.x 的核心特点之一是 https://vertx.io/docs/vertx-core/java/#event_bus[事件总线]。它为你的应用程序提供了基于消息的主干。因此，你可以使用异步消息传递的方式在组件之间进行交互，并且将你的组件解耦。您可以向单个消费者发送消息，或分派给多个消费者，亦或是实现请求-响应的交互，在其中发送消息（请求）并期许响应。这是我们将在本节中使用的内容。我们的 `VertxResource` 将向问候地址发送一条包含姓名的消息。另一个组件将会接收到这条消息并生成 "hello $name" 的响应。 `VertxResource` 将收到响应并将其作为 HTTP 响应进行返回。

source: One of the main goals of Quarkus is ease of extensibility and to build a vibrant ecosystem.
zh_cn: Quarkus的主要目标之一是易于扩展和构建一个充满活力的生态系统。

source: One of these annotations is the `@BsonDiscriminator` annotation that allows to storage multiple Java types in a single MongoDB collection by adding a discriminator field inside the document. It can be useful when working with abstract types or interfaces.
zh_cn: 其中一个注解是 `@BsonDiscriminator` ，它允许通过在文档中添加一个判别字段来在单个MongoDB集合中存储多个Java类型。在处理抽象类型或接口时，它可能很有用。

source: One thing to note about the create command for native is that the `aws lambda create-function` call must set a specific environment variable:
zh_cn: 对于原生的创建命令，需要注意的一点是， `aws lambda create-function` 调用必须设置一个特定的环境变量：
